machadevrepos/ExoSuit_Firmware/firmware/lower_hub/STM32_WPAN/App/app_ble.c
  /* USER CODE BEGIN APP_BLE_Init_3 */

  /* USER CODE END APP_BLE_Init_3 */

  exo_hub_central_client_init();
  exo_hub_central_client_set_ble_ready();

  /* USER CODE BEGIN APP_BLE_Init_2 */

  /* USER CODE END APP_BLE_Init_2 */

  return;
}

/* U11 is a central-only bridge.  Do not let the generated service registry
 * add the unused P2P server service and consume GATT attributes/handlers. */
void SVCCTL_SvcInit(void)
{
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt)
{
  hci_event_pckt    *p_event_pckt;
  evt_le_meta_event *p_meta_evt;
  evt_blecore_aci   *p_blecore_evt;
  uint8_t           Tx_phy, Rx_phy;
  tBleStatus        ret = BLE_STATUS_INVALID_PARAMS;
  hci_le_connection_complete_event_rp0        *p_connection_complete_event;
  hci_disconnection_complete_event_rp0        *p_disconnection_complete_event;
  hci_le_phy_update_complete_event_rp0        *p_evt_le_phy_update_complete;
#if (CFG_DEBUG_APP_TRACE != 0)
  hci_le_connection_update_complete_event_rp0 *p_connection_update_complete_event;
#endif /* CFG_DEBUG_APP_TRACE != 0 */

  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;

  switch (p_event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;

      if (p_disconnection_complete_event->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
      {
        BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
        BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
        APP_DBG_MSG(">>== HCI_DISCONNECTION_COMPLETE_EVT_CODE\n");
        APP_DBG_MSG("     - Connection Handle:   0x%x\n     - Reason:    0x%x\n\r",
                    p_disconnection_complete_event->Connection_Handle,
                    p_disconnection_complete_event->Reason);

        /* USER CODE BEGIN EVT_DISCONN_COMPLETE_2 */

        /* USER CODE END EVT_DISCONN_COMPLETE_2 */
      }

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_1 */

      exo_hub_central_client_on_disconnection_complete(
          p_disconnection_complete_event->Connection_Handle,
          p_disconnection_complete_event->Reason);

      /* USER CODE END EVT_DISCONN_COMPLETE_1 */

      /* U11 is central-only and does not restart advertising. */
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

      /* USER CODE END EVT_DISCONN_COMPLETE */
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */
    }

    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      if (p_meta_evt->subevent == HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE)
      {
        const uint8_t *raw_adv = (const uint8_t *)p_meta_evt->data;
        const uint8_t raw_adv_len = (p_event_pckt->plen > 1U) ?
                                    (uint8_t)(p_event_pckt->plen - 1U) : 0U;
        if (raw_adv_len >= 11U && raw_adv[0] != 0U)
        {
          Advertising_Report_t report;
          const uint8_t data_len = raw_adv[9];
          if (data_len <= 31U && (uint8_t)(10U + data_len) < raw_adv_len)
          {
            report.Event_Type = raw_adv[1];
            report.Address_Type = raw_adv[2];
            memcpy(report.Address, &raw_adv[3], sizeof(report.Address));
            report.Length_Data = data_len;
            report.Data = &raw_adv[10];
            report.RSSI = raw_adv[10U + data_len];
            hci_le_advertising_report_event(1U, &report);
          }
        }
      }

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
#if (CFG_DEBUG_APP_TRACE != 0)
          p_connection_update_complete_event = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n\r",
                       p_connection_update_complete_event->Conn_Interval*1.25,
                       p_connection_update_complete_event->Conn_Latency,
                       p_connection_update_complete_event->Supervision_Timeout*10);
#endif /* CFG_DEBUG_APP_TRACE != 0 */

          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */
          {
            const hci_le_connection_update_complete_event_rp0 *event =
                (const hci_le_connection_update_complete_event_rp0 *)p_meta_evt->data;
            exo_hub_central_client_on_connection_update_complete(
                event->Status, event->Connection_Handle, event->Conn_Interval,
                event->Conn_Latency, event->Supervision_Timeout);
          }
          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;

        case HCI_LE_DATA_LENGTH_CHANGE_SUBEVT_CODE:
        {
          const hci_le_data_length_change_event_rp0 *event =
              (const hci_le_data_length_change_event_rp0 *)p_meta_evt->data;
          exo_hub_central_client_on_data_length_change(
              event->Connection_Handle, event->MaxTxOctets, event->MaxTxTime,
              event->MaxRxOctets, event->MaxRxTime);
          break;
        }

        case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
          p_evt_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)p_meta_evt->data;
          APP_DBG_MSG("==>> HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE - ");
          if (p_evt_le_phy_update_complete->Status == 0)
          {
            APP_DBG_MSG("status ok \n");
          }
          else
          {
            APP_DBG_MSG("status nok \n");
          }

          ret = hci_le_read_phy(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, &Tx_phy, &Rx_phy);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> hci_le_read_phy : fail\n\r");
          }
          else
          {
            APP_DBG_MSG("==>> hci_le_read_phy - Success \n");

