machadevrepos/ExoSuit_Firmware/firmware/lower_hub/STM32_WPAN/App/app_ble.c
            if ((Tx_phy == TX_2M) && (Rx_phy == RX_2M))
            {
              APP_DBG_MSG("==>> PHY Param  TX= %d, RX= %d \n\r", Tx_phy, Rx_phy);
            }
            else
            {
              APP_DBG_MSG("==>> PHY Param  TX= %d, RX= %d \n\r", Tx_phy, Rx_phy);
            }
          }
          /* USER CODE BEGIN EVT_LE_PHY_UPDATE_COMPLETE */

          exo_hub_central_client_on_phy_update_complete(
              p_evt_le_phy_update_complete->Status,
              p_evt_le_phy_update_complete->Connection_Handle,
              p_evt_le_phy_update_complete->TX_PHY,
              p_evt_le_phy_update_complete->RX_PHY);

          /* USER CODE END EVT_LE_PHY_UPDATE_COMPLETE */
          break;

        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          p_connection_complete_event = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;
          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */

          APP_DBG_MSG(">>== HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%x\n", p_connection_complete_event->Connection_Handle);
          APP_DBG_MSG("     - Connection established with Central: @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_connection_complete_event->Peer_Address[5],
                      p_connection_complete_event->Peer_Address[4],
                      p_connection_complete_event->Peer_Address[3],
                      p_connection_complete_event->Peer_Address[2],
                      p_connection_complete_event->Peer_Address[1],
                      p_connection_complete_event->Peer_Address[0]);
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n\r",
                      p_connection_complete_event->Conn_Interval*1.25,
                      p_connection_complete_event->Conn_Latency,
                      p_connection_complete_event->Supervision_Timeout*10
                     );

          if (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
          {
            /* Connection as client */
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          }
          else
          {
            /* Connection as server */
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
          }
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = p_connection_complete_event->Connection_Handle;
          /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */

          exo_hub_central_client_on_connection_complete(
              1U,
              p_connection_complete_event->Status,
              p_connection_complete_event->Connection_Handle,
              p_connection_complete_event->Peer_Address_Type,
              p_connection_complete_event->Peer_Address);

          /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
        }

        default:
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
      break; /* HCI_LE_META_EVT_CODE */
    }

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      if (p_blecore_evt->ecode == ACI_GAP_PROC_COMPLETE_VSEVT_CODE)
      {
        const aci_gap_proc_complete_event_rp0 *event =
            (const aci_gap_proc_complete_event_rp0 *)p_blecore_evt->data;
        aci_gap_proc_complete_event(event->Procedure_Code, event->Status,
                                     event->Data_Length, event->Data);
      }
      else if (p_blecore_evt->ecode == ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE)
      {
        const aci_att_read_by_group_type_resp_event_rp0 *event =
            (const aci_att_read_by_group_type_resp_event_rp0 *)p_blecore_evt->data;
        aci_att_read_by_group_type_resp_event(event->Connection_Handle,
                                              event->Attribute_Data_Length,
                                              event->Data_Length,
                                              event->Attribute_Data_List);
      }
      else if (p_blecore_evt->ecode == ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE)
      {
        const aci_att_read_by_type_resp_event_rp0 *event =
            (const aci_att_read_by_type_resp_event_rp0 *)p_blecore_evt->data;
        aci_att_read_by_type_resp_event(event->Connection_Handle,
                                        event->Handle_Value_Pair_Length,
                                        event->Data_Length,
                                        event->Handle_Value_Pair_Data);
      }
      else if (p_blecore_evt->ecode == ACI_GATT_NOTIFICATION_VSEVT_CODE)
      {
        const aci_gatt_notification_event_rp0 *event =
            (const aci_gatt_notification_event_rp0 *)p_blecore_evt->data;
        aci_gatt_notification_event(event->Connection_Handle,
                                     event->Attribute_Handle,
                                     event->Attribute_Value_Length,
                                     event->Attribute_Value);
      }
      else if (p_blecore_evt->ecode == ACI_GATT_INDICATION_VSEVT_CODE)
      {
        const aci_gatt_indication_event_rp0 *event =
            (const aci_gatt_indication_event_rp0 *)p_blecore_evt->data;
        aci_gatt_indication_event(event->Connection_Handle,
                                  event->Attribute_Handle,
                                  event->Attribute_Value_Length,
                                  event->Attribute_Value);
        (void)aci_gatt_confirm_indication(event->Connection_Handle);
      }
      else if (p_blecore_evt->ecode == ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE)
      {
        const aci_att_exchange_mtu_resp_event_rp0 *event =
            (const aci_att_exchange_mtu_resp_event_rp0 *)p_blecore_evt->data;
        aci_att_exchange_mtu_resp_event(event->Connection_Handle,
                                        event->Server_RX_MTU);
      }
      else if (p_blecore_evt->ecode == ACI_GATT_PROC_COMPLETE_VSEVT_CODE)
      {
        const aci_gatt_proc_complete_event_rp0 *event =
            (const aci_gatt_proc_complete_event_rp0 *)p_blecore_evt->data;
        aci_gatt_proc_complete_event(event->Connection_Handle, event->Error_Code);
      }

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ecode */

        /* USER CODE END ecode */

        /**
         * SPECIFIC to P2P Server APP
         */
        case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
          mutex = 1;
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */
          /* USER CODE BEGIN EVT_BLUE_L2CAP_CONNECTION_UPDATE_RESP */

          /* USER CODE END EVT_BLUE_L2CAP_CONNECTION_UPDATE_RESP */
          break;

        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
          APP_DBG_MSG(">>== ACI_GAP_PROC_COMPLETE_VSEVT_CODE \r");
          /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

          /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
          break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */

#if (RADIO_ACTIVITY_EVENT != 0)
        case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
          /* USER CODE BEGIN RADIO_ACTIVITY_EVENT*/

          /* USER CODE END RADIO_ACTIVITY_EVENT*/
          break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
#endif /* RADIO_ACTIVITY_EVENT != 0 */

